{
  "<PAD>": 0,
  "<UNK>": 1,
  "po": 2,
  "supreme": 3,
  "court": 4,
  "pakistan": 5,
  "2": 6,
  "ae": 7,
  "appellate": 8,
  "jurisdiction": 9,
  "present": 10,
  "justice": 11,
  "yahya": 12,
  "afridi": 13,
  "cj": 14,
  "miangul": 15,
  "hassan": 16,
  "aurangzeb": 17,
  "cpla": 18,
  "2788": 19,
  "2022": 20,
  "judgment": 21,
  "dated": 22,
  "16": 23,
  "06": 24,
  "islamabad": 25,
  "high": 26,
  "passed": 27,
  "w": 28,
  "p": 29,
  "2021": 30,
  "javed": 31,
  "another": 32,
  "petitioners": 33,
  "versus": 34,
  "ahmed": 35,
  "bilal": 36,
  "others": 37,
  "respondents": 38,
  "ch": 39,
  "hafeez": 40,
  "ullah": 41,
  "yaqub": 42,
  "asc": 43,
  "respondent": 44,
  "1": 45,
  "person": 46,
  "mr": 47,
  "umar": 48,
  "farooq": 49,
  "deputy": 50,
  "registrar": 51,
  "mediator": 52,
  "date": 53,
  "hearing": 54,
  "30": 55,
  "2025": 56,
  "order": 57,
  "j": 58,
  "instant": 59,
  "petition": 60,
  "shazia": 61,
  "waheed": 62,
  "called": 63,
  "question": 64,
  "whereby": 65,
  "writ": 66,
  "filed": 67,
  "concurrent": 68,
  "judgments": 69,
  "decrees": 70,
  "26": 71,
  "10": 72,
  "2020": 73,
  "01": 74,
  "judge": 75,
  "guardian": 76,
  "respectively": 77,
  "allowed": 78,
  "setting": 79,
  "aside": 80,
  "said": 81,
  "certain": 82,
  "directions": 83,
  "vide": 84,
  "decree": 85,
  "dismissed": 86,
  "appeal": 87,
  "application": 88,
  "section": 89,
  "25": 90,
  "guardians": 91,
  "wards": 92,
  "act": 93,
  "1890": 94,
  "seeking": 95,
  "permanent": 96,
  "custody": 97,
  "minor": 98,
  "meher": 99,
  "fatima": 100,
  "turned": 101,
  "resulting": 102,
  "remain": 103,
  "maternal": 104,
  "petitioner": 105,
  "herein": 106,
  "additionally": 107,
  "also": 108,
  "schedule": 109,
  "father": 110,
  "mother": 111,
  "died": 112,
  "prior": 113,
  "initiation": 114,
  "battle": 115,
  "orders": 116,
  "holding": 117,
  "inter": 118,
  "alia": 119,
  "third": 120,
  "party": 121,
  "appointed": 122,
  "stead": 123,
  "biological": 124,
  "parent": 125,
  "child": 126,
  "alive": 127,
  "found": 128,
  "reason": 129,
  "taken": 130,
  "3": 131,
  "first": 132,
  "08": 133,
  "12": 134,
  "2023": 135,
  "notices": 136,
  "directed": 137,
  "issued": 138,
  "matter": 139,
  "remained": 140,
  "pending": 141,
  "14": 142,
  "05": 143,
  "suggested": 144,
  "contesting": 145,
  "parties": 146,
  "resolve": 147,
  "disputes": 148,
  "process": 149,
  "mediation": 150,
  "done": 151,
  "bearing": 152,
  "mind": 153,
  "article": 154,
  "united": 155,
  "nations": 156,
  "convention": 157,
  "rights": 158,
  "11": 159,
  "1990": 160,
  "courts": 161,
  "best": 162,
  "interests": 163,
  "children": 164,
  "general": 165,
  "2013": 166,
  "adopted": 167,
  "committee": 168,
  "session": 169,
  "stresses": 170,
  "principle": 171,
  "passive": 172,
  "demands": 173,
  "judicial": 174,
  "authorities": 175,
  "facilitate": 176,
  "participatory": 177,
  "mechanism": 178,
  "including": 179,
  "4": 180,
  "gave": 181,
  "consent": 182,
  "dispute": 183,
  "regarding": 184,
  "ancillary": 185,
  "matters": 186,
  "resolved": 187,
  "referred": 188,
  "duly": 189,
  "notified": 190,
  "law": 191,
  "division": 192,
  "provisions": 193,
  "alternative": 194,
  "2017": 195,
  "required": 196,
  "conduct": 197,
  "complete": 198,
  "within": 199,
  "period": 200,
  "one": 201,
  "month": 202,
  "submit": 203,
  "report": 204,
  "18": 205,
  "urged": 206,
  "make": 207,
  "efforts": 208,
  "earliest": 209,
  "conclude": 210,
  "clarified": 211,
  "give": 212,
  "decision": 213,
  "role": 214,
  "limited": 215,
  "arriving": 216,
  "settlement": 217,
  "observe": 218,
  "confidentiality": 219,
  "disclose": 220,
  "information": 221,
  "without": 222,
  "permission": 223,
  "restricted": 224,
  "following": 225,
  "identifying": 226,
  "unreasonable": 227,
  "refusal": 228,
  "intentional": 229,
  "ii": 230,
  "exchanged": 231,
  "brief": 232,
  "description": 233,
  "respective": 234,
  "offers": 235,
  "points": 236,
  "agreed": 237,
  "provided": 238,
  "contain": 239,
  "except": 240,
  "extent": 241,
  "writing": 242,
  "furthermore": 243,
  "event": 244,
  "succeed": 245,
  "agreement": 246,
  "file": 247,
  "signed": 248,
  "countersigned": 249,
  "6": 250,
  "ensued": 251,
  "resulted": 252,
  "educational": 253,
  "arrangements": 254,
  "mechanisms": 255,
  "future": 256,
  "cooperation": 257,
  "aimed": 258,
  "welfare": 259,
  "appeared": 260,
  "welcome": 261,
  "copy": 262,
  "17": 263,
  "placed": 264,
  "record": 265,
  "reflects": 266,
  "model": 267,
  "co": 268,
  "grounded": 269,
  "long": 270,
  "term": 271,
  "case": 272,
  "effort": 273,
  "shift": 274,
  "narrative": 275,
  "adversarial": 276,
  "mutual": 277,
  "understanding": 278,
  "outcome": 279,
  "stands": 280,
  "affirmation": 281,
  "form": 282,
  "resolution": 283,
  "pathway": 284,
  "substantive": 285,
  "testament": 286,
  "fact": 287,
  "emotional": 288,
  "preserved": 289,
  "litigation": 290,
  "alone": 291,
  "8": 292,
  "made": 293,
  "guiding": 294,
  "towards": 295,
  "productive": 296,
  "communication": 297,
  "shared": 298,
  "commitment": 299,
  "successful": 300,
  "03": 301,
  "office": 302,
  "shall": 303,
  "transmit": 304,
  "along": 305,
  "draw": 306,
  "terms": 307,
  "thereof": 308,
  "disposed": 309,
  "impugned": 310,
  "modified": 311,
  "inconsistency": 312,
  "30th": 313,
  "june": 314,
  "approved": 315,
  "reporting": 316,
  "muhammad": 317,
  "hashim": 318,
  "khan": 319,
  "kakar": 320,
  "ishtiaq": 321,
  "ibrahim": 322,
  "ali": 323,
  "baqar": 324,
  "najafi": 325,
  "jail": 326,
  "554": 327,
  "criminal": 328,
  "127": 329,
  "07": 330,
  "09": 331,
  "cr": 332,
  "116": 333,
  "b": 334,
  "117": 335,
  "peshawar": 336,
  "bannu": 337,
  "bench": 338,
  "umer": 339,
  "jan": 340,
  "cases": 341,
  "state": 342,
  "ag": 343,
  "khyber": 344,
  "pakhtunkhwa": 345,
  "rai": 346,
  "azhar": 347,
  "iqbal": 348,
  "syed": 349,
  "rifaqat": 350,
  "hussain": 351,
  "shah": 352,
  "aor": 353,
  "zahid": 354,
  "yousaf": 355,
  "qureshi": 356,
  "complainant": 357,
  "19": 358,
  "accused": 359,
  "amanullah": 360,
  "tried": 361,
  "learned": 362,
  "additional": 363,
  "sessions": 364,
  "iv": 365,
  "lakki": 366,
  "marwat": 367,
  "trial": 368,
  "arising": 369,
  "fir": 370,
  "210": 371,
  "2018": 372,
  "registered": 373,
  "police": 374,
  "station": 375,
  "sections": 376,
  "302": 377,
  "324": 378,
  "34": 379,
  "penal": 380,
  "code": 381,
  "1860": 382,
  "ppc": 383,
  "charge": 384,
  "committing": 385,
  "qatl": 386,
  "e": 387,
  "amd": 388,
  "rehmatullah": 389,
  "deceased": 390,
  "attempted": 391,
  "murder": 392,
  "ayaz": 393,
  "211": 394,
  "15": 395,
  "arms": 396,
  "upon": 397,
  "conclusion": 398,
  "trials": 399,
  "convicted": 400,
  "sentenced": 401,
  "undergo": 402,
  "rigorous": 403,
  "imprisonment": 404,
  "twenty": 405,
  "five": 406,
  "years": 407,
  "ta": 408,
  "pay": 409,
  "compensation": 410,
  "sum": 411,
  "rs": 412,
  "100": 413,
  "000": 414,
  "legal": 415,
  "heirs": 416,
  "544": 417,
  "procedure": 418,
  "1898": 419,
  "c": 420,
  "default": 421,
  "simple": 422,
  "six": 423,
  "months": 424,
  "fine": 425,
  "50": 426,
  "payment": 427,
  "kp": 428,
  "ri": 429,
  "20": 430,
  "two": 431,
  "aggrieved": 432,
  "conviction": 433,
  "sentences": 434,
  "convicts": 435,
  "preferred": 436,
  "appeals": 437,
  "nos": 438,
  "simultaneously": 439,
  "revision": 440,
  "36": 441,
  "enhancement": 442,
  "sentence": 443,
  "awarded": 444,
  "life": 445,
  "normal": 446,
  "penalty": 447,
  "death": 448,
  "contemplated": 449,
  "thereby": 450,
  "maintaining": 451,
  "recorded": 452,
  "however": 453,
  "whose": 454,
  "set": 455,
  "acquitted": 456,
  "seeks": 457,
  "leave": 458,
  "acquittal": 459,
  "prosecution": 460,
  "forth": 461,
  "exh": 462,
  "pa": 463,
  "pw": 464,
  "4a": 465,
  "accompanied": 466,
  "brothers": 467,
  "mehmood": 468,
  "5": 469,
  "way": 470,
  "village": 471,
  "shagai": 472,
  "extend": 473,
  "eid": 474,
  "married": 475,
  "residing": 476,
  "hours": 477,
  "reached": 478,
  "near": 479,
  "masjid": 480,
  "abdul": 481,
  "situated": 482,
  "fields": 483,
  "since": 484,
  "armed": 485,
  "kalashnikovs": 486,
  "allegedly": 487,
  "emerged": 488,
  "construction": 489,
  "mosque": 490,
  "opened": 491,
  "indiscriminate": 492,
  "fire": 493,
  "result": 494,
  "sustained": 495,
  "firearm": 496,
  "injuries": 497,
  "ition": 498,
  "spot": 499,
  "whereas": 500,
  "brother": 501,
  "motive": 502,
  "attributed": 503,
  "occurrence": 504,
  "existing": 505,
  "blood": 506,
  "feud": 507,
  "day": 508,
  "arrested": 509,
  "ghulam": 510,
  "asi": 511,
  "recovered": 512,
  "kalashnikov": 513,
  "possession": 514,
  "convict": 515,
  "separate": 516,
  "ibid": 517,
  "arrest": 518,
  "completion": 519,
  "investigation": 520,
  "reports": 521,
  "173": 522,
  "firs": 523,
  "submitted": 524,
  "formally": 525,
  "charged": 526,
  "sheeted": 527,
  "pleaded": 528,
  "guilty": 529,
  "claimed": 530,
  "concluded": 531,
  "evidence": 532,
  "statements": 533,
  "342": 534,
  "wherein": 535,
  "denied": 536,
  "allegations": 537,
  "levelled": 538,
  "professed": 539,
  "innocence": 540,
  "opted": 541,
  "oath": 542,
  "340": 543,
  "expressed": 544,
  "intention": 545,
  "lead": 546,
  "defence": 547,
  "statement": 548,
  "reproduced": 549,
  "ul": 550,
  "motorcycle": 551,
  "driven": 552,
  "cousin": 553,
  "adnan": 554,
  "aunt": 555,
  "mst": 556,
  "bibi": 557,
  "kids": 558,
  "going": 559,
  "go": 560,
  "labour": 561,
  "punjab": 562,
  "ghani": 563,
  "ur": 564,
  "rehman": 565,
  "sons": 566,
  "sarwar": 567,
  "started": 568,
  "firing": 569,
  "us": 570,
  "back": 571,
  "son": 572,
  "sohrab": 573,
  "stopped": 574,
  "riders": 575,
  "took": 576,
  "shelter": 577,
  "nearby": 578,
  "houses": 579,
  "went": 580,
  "inside": 581,
  "self": 582,
  "stated": 583,
  "continued": 584,
  "three": 585,
  "local": 586,
  "came": 587,
  "waiting": 588,
  "diminishing": 589,
  "later": 590,
  "entered": 591,
  "therefore": 592,
  "women": 593,
  "folk": 594,
  "house": 595,
  "water": 596,
  "sit": 597,
  "official": 598,
  "pick": 599,
  "datsun": 600,
  "etc": 601,
  "still": 602,
  "making": 603,
  "n": 604,
  "brought": 605,
  "khel": 606,
  "narrated": 607,
  "actual": 608,
  "facts": 609,
  "0": 610,
  "considering": 611,
  "commission": 612,
  "offence": 613,
  "produced": 614,
  "dw": 615,
  "supported": 616,
  "version": 617,
  "heard": 618,
  "arguments": 619,
  "counsel": 620,
  "perused": 621,
  "must": 622,
  "stand": 623,
  "legs": 624,
  "prove": 625,
  "beyond": 626,
  "reasonable": 627,
  "doubt": 628,
  "independent": 629,
  "reliable": 630,
  "confidence": 631,
  "inspiring": 632,
  "take": 633,
  "advantage": 634,
  "perceived": 635,
  "weakness": 636,
  "burden": 637,
  "merely": 638,
  "takes": 639,
  "plea": 640,
  "fails": 641,
  "rule": 642,
  "laid": 643,
  "consistently": 644,
  "establish": 645,
  "even": 646,
  "creates": 647,
  "entitled": 648,
  "benefit": 649,
  "right": 650,
  "grace": 651,
  "eyewitness": 652,
  "jointly": 653,
  "lan": 654,
  "none": 655,
  "ever": 656,
  "deposed": 657,
  "empty": 658,
  "handed": 659,
  "fatal": 660,
  "shot": 661,
  "fired": 662,
  "testimony": 663,
  "treats": 664,
  "persons": 665,
  "alike": 666,
  "attributes": 667,
  "equal": 668,
  "culpability": 669,
  "noted": 670,
  "proceeded": 671,
  "maintain": 672,
  "exercise": 673,
  "completely": 674,
  "settled": 675,
  "appreciation": 676,
  "particularly": 677,
  "distinguish": 678,
  "coaccused": 679,
  "grounds": 680,
  "basis": 681,
  "distinguished": 682,
  "admission": 683,
  "time": 684,
  "speaks": 685,
  "otherwise": 686,
  "recovery": 687,
  "memo": 688,
  "mn": 689,
  "clearly": 690,
  "demonstrates": 691,
  "butt": 692,
  "stock": 693,
  "r": 694,
  "shown": 695,
  "moreover": 696,
  "inspection": 697,
  "fifteen": 698,
  "spent": 699,
  "crime": 700,
  "empties": 701,
  "7": 702,
  "62": 703,
  "bore": 704,
  "collected": 705,
  "places": 706,
  "sent": 707,
  "fsl": 708,
  "forensic": 709,
  "analysis": 710,
  "science": 711,
  "laboratory": 712,
  "pk": 713,
  "reveals": 714,
  "marked": 715,
  "opined": 716,
  "discharged": 717,
  "1977": 718,
  "remaining": 719,
  "ten": 720,
  "scene": 721,
  "either": 722,
  "distinction": 723,
  "drawn": 724,
  "appears": 725,
  "speculative": 726,
  "inconsistent": 727,
  "reliance": 728,
  "portions": 729,
  "rest": 730,
  "principles": 731,
  "undermines": 732,
  "fairness": 733,
  "proceedings": 734,
  "9": 735,
  "emerges": 736,
  "inception": 737,
  "place": 738,
  "manner": 739,
  "alleged": 740,
  "rather": 741,
  "according": 742,
  "incident": 743,
  "cross": 744,
  "side": 745,
  "put": 746,
  "material": 747,
  "witnesses": 748,
  "examination": 749,
  "finds": 750,
  "support": 751,
  "documentary": 752,
  "da": 753,
  "22": 754,
  "peace": 755,
  "sets": 756,
  "investigating": 757,
  "officer": 758,
  "munawar": 759,
  "si": 760,
  "crossexamination": 761,
  "conceded": 762,
  "passerby": 763,
  "named": 764,
  "islam": 765,
  "qasim": 766,
  "shifted": 767,
  "hospital": 768,
  "ultimately": 769,
  "succumbed": 770,
  "admitted": 771,
  "neither": 772,
  "injured": 773,
  "relatives": 774,
  "several": 775,
  "villagers": 776,
  "informed": 777,
  "approximately": 778,
  "people": 779,
  "area": 780,
  "told": 781,
  "di": 782,
  "ti": 783,
  "proceeding": 784,
  "intended": 785,
  "travel": 786,
  "lahore": 787,
  "departure": 788,
  "intercepted": 789,
  "admissions": 790,
  "cast": 791,
  "serious": 792,
  "glance": 793,
  "site": 794,
  "plan": 795,
  "occurred": 796,
  "thoroughfare": 797,
  "front": 798,
  "inconceivable": 799,
  "claim": 800,
  "directly": 801,
  "assailants": 802,
  "weapons": 803,
  "receive": 804,
  "scratch": 805,
  "continuous": 806,
  "per": 807,
  "yet": 808,
  "raising": 809,
  "questions": 810,
  "veracity": 811,
  "presence": 812,
  "truthfulness": 813,
  "account": 814,
  "sharing": 815,
  "common": 816,
  "stood": 817,
  "footing": 818,
  "conveniently": 819,
  "escaped": 820,
  "injury": 821,
  "viewed": 822,
  "entirety": 823,
  "contradictions": 824,
  "ee": 825,
  "relied": 826,
  "contrary": 827,
  "norms": 828,
  "mode": 829,
  "surrounding": 830,
  "circumstances": 831,
  "discussed": 832,
  "coupled": 833,
  "concealment": 834,
  "suggest": 835,
  "different": 836,
  "concealed": 837,
  "failing": 838,
  "come": 839,
  "clean": 840,
  "hands": 841,
  "proved": 842,
  "impartial": 843,
  "pregnant": 844,
  "doubts": 845,
  "extended": 846,
  "concession": 847,
  "13": 848,
  "reasons": 849,
  "converted": 850,
  "appellant": 851,
  "hereby": 852,
  "liberty": 853,
  "forthwith": 854,
  "lin": 855,
  "view": 856,
  "discussion": 857,
  "mentioned": 858,
  "consequently": 859,
  "siraj": 860,
  "ps": 861,
  "amin": 862,
  "ud": 863,
  "din": 864,
  "hasan": 865,
  "rizvi": 866,
  "1033": 867,
  "crl": 868,
  "misc": 869,
  "ba": 870,
  "amjad": 871,
  "altaf": 872,
  "addl": 873,
  "kpk": 874,
  "dsp": 875,
  "inspector": 876,
  "abid": 877,
  "miscellaneous": 878,
  "bail": 879,
  "upholding": 880,
  "swabi": 881,
  "declined": 882,
  "well": 883,
  "shahid": 884,
  "arose": 885,
  "04": 886,
  "00": 887,
  "basit": 888,
  "alleging": 889,
  "23": 890,
  "abu": 891,
  "bakar": 892,
  "aged": 893,
  "firearms": 894,
  "owing": 895,
  "family": 896,
  "property": 897,
  "commit": 898,
  "claims": 899,
  "witnessed": 900,
  "bulb": 901,
  "light": 902,
  "dhq": 903,
  "subsequently": 904,
  "lodged": 905,
  "dd": 906,
  "pertaining": 907,
  "granted": 908,
  "v": 909,
  "moved": 910,
  "24": 911,
  "met": 912,
  "fate": 913,
  "dismissal": 914,
  "challenge": 915,
  "contends": 916,
  "generalized": 917,
  "allegation": 918,
  "specification": 919,
  "individual": 920,
  "roles": 921,
  "falsely": 922,
  "implicated": 923,
  "mala": 924,
  "fide": 925,
  "already": 926,
  "story": 927,
  "suffers": 928,
  "leaves": 929,
  "assailant": 930,
  "identified": 931,
  "assisted": 932,
  "submits": 933,
  "specifically": 934,
  "nominated": 935,
  "direct": 936,
  "argued": 937,
  "shortly": 938,
  "thereafter": 939,
  "weapon": 940,
  "used": 941,
  "earlier": 942,
  "affected": 943,
  "emphasizes": 944,
  "personally": 945,
  "lastly": 946,
  "protracted": 947,
  "culminated": 948,
  "brutal": 949,
  "gravity": 950,
  "query": 951,
  "qua": 952,
  "initially": 953,
  "negative": 954,
  "photocopy": 955,
  "confirmed": 956,
  "match": 957,
  "admittedly": 958,
  "attributing": 959,
  "tentative": 960,
  "assessment": 961,
  "available": 962,
  "whereof": 963,
  "renders": 964,
  "doubtful": 965,
  "objected": 966,
  "opinion": 967,
  "evidentiary": 968,
  "value": 969,
  "formed": 970,
  "recording": 971,
  "pertinent": 972,
  "sole": 973,
  "specify": 974,
  "distinct": 975,
  "played": 976,
  "narration": 977,
  "nature": 978,
  "specific": 979,
  "makes": 980,
  "fit": 981,
  "inquiry": 982,
  "considered": 983,
  "squarely": 984,
  "falls": 985,
  "ambit": 986,
  "497": 987,
  "entitling": 988,
  "ground": 989,
  "guilt": 990,
  "post": 991,
  "subject": 992,
  "furnishing": 993,
  "bonds": 994,
  "200": 995,
  "lacs": 996,
  "surety": 997,
  "like": 998,
  "amount": 999,
  "satisfaction": 1000,
  "parting": 1001,
  "reiterated": 1002,
  "observations": 1003,
  "hereinabove": 1004,
  "independently": 1005,
  "adjudicate": 1006,
  "merits": 1007,
  "influenced": 1008,
  "younus": 1009,
  "shaikh": 1010,
  "lc": 1011,
  "shafi": 1012,
  "siddiqui": 1013,
  "petitions": 1014,
  "1184": 1015,
  "1191": 1016,
  "2155": 1017,
  "imran": 1018,
  "ahmad": 1019,
  "niazi": 1020,
  "prosecutor": 1021,
  "salman": 1022,
  "safdar": 1023,
  "jawaid": 1024,
  "masood": 1025,
  "tahir": 1026,
  "bhatti": 1027,
  "haider": 1028,
  "advocate": 1029,
  "zulfiqar": 1030,
  "abbas": 1031,
  "naqvi": 1032,
  "special": 1033,
  "h": 1034,
  "dr": 1035,
  "javaid": 1036,
  "asif": 1037,
  "mumtaz": 1038,
  "afzal": 1039,
  "ashraf": 1040,
  "alam": 1041,
  "call": 1042,
  "raza": 1043,
  "gillani": 1044,
  "21": 1045,
  "sought": 1046,
  "refused": 1047,
  "1570": 1048,
  "103": 1049,
  "109": 1050,
  "108": 1051,
  "96": 1052,
  "race": 1053,
  "course": 1054,
  "road": 1055,
  "district": 1056,
  "respect": 1057,
  "offences": 1058,
  "395": 1059,
  "452": 1060,
  "427": 1061,
  "353": 1062,
  "354": 1063,
  "391": 1064,
  "186": 1065,
  "290": 1066,
  "291": 1067,
  "153": 1068,
  "152": 1069,
  "148": 1070,
  "149": 1071,
  "147": 1072,
  "505": 1073,
  "506": 1074,
  "120": 1075,
  "225": 1076,
  "337": 1077,
  "f": 1078,
  "l": 1079,
  "iii": 1080,
  "336": 1081,
  "449": 1082,
  "146": 1083,
  "131": 1084,
  "121": 1085,
  "188": 1086,
  "201": 1087,
  "read": 1088,
  "anti": 1089,
  "terrorism": 1090,
  "1997": 1091,
  "maintenance": 1092,
  "public": 1093,
  "ordinance": 1094,
  "1960": 1095,
  "1965": 1096,
  "main": 1097,
  "thrust": 1098,
  "revolves": 1099,
  "around": 1100,
  "conspiracy": 1101,
  "end": 1102,
  "drew": 1103,
  "attention": 1104,
  "ocular": 1105,
  "electronic": 1106,
  "media": 1107,
  "implicate": 1108,
  "connect": 1109,
  "confronted": 1110,
  "grant": 1111,
  "rendered": 1112,
  "ejaz": 1113,
  "chaudhary": 1114,
  "imtiaz": 1115,
  "hafiz": 1116,
  "farhat": 1117,
  "linked": 1118,
  "similarly": 1119,
  "responded": 1120,
  "distinguishable": 1121,
  "consistency": 1122,
  "would": 1123,
  "apply": 1124,
  "definite": 1125,
  "findings": 1126,
  "refusing": 1127,
  "explained": 1128,
  "ina": 1129,
  "granting": 1130,
  "vehemently": 1131,
  "opposed": 1132,
  "contentions": 1133,
  "raised": 1134,
  "particular": 1135,
  "emphasized": 1136,
  "applied": 1137,
  "favour": 1138,
  "namely": 1139,
  "mahmood": 1140,
  "thus": 1141,
  "surely": 1142,
  "fall": 1143,
  "domain": 1144,
  "positively": 1145,
  "better": 1146,
  "pointed": 1147,
  "chaudhry": 1148,
  "completed": 1149,
  "commenced": 1150,
  "stages": 1151,
  "entitlement": 1152,
  "root": 1153,
  "contested": 1154,
  "passing": 1155,
  "legality": 1156,
  "concern": 1157,
  "stage": 1158,
  "confined": 1159,
  "lest": 1160,
  "pass": 1161,
  "may": 1162,
  "prejudice": 1163,
  "sufficient": 1164,
  "requires": 1165,
  "scrutiny": 1166,
  "adjudged": 1167,
  "pro": 1168,
  "addition": 1169,
  "thereto": 1170,
  "bond": 1171,
  "chief": 1172,
  "21st": 1173,
  "august": 1174,
  "mazhar": 1175,
  "irfan": 1176,
  "saadat": 1177,
  "malik": 1178,
  "shahzad": 1179,
  "745": 1180,
  "16268": 1181,
  "khawar": 1182,
  "ameer": 1183,
  "bukhari": 1184,
  "tariq": 1185,
  "siddique": 1186,
  "g": 1187,
  "bashir": 1188,
  "1778": 1189,
  "2024": 1190,
  "31": 1191,
  "chak": 1192,
  "jhumra": 1193,
  "faisalabad": 1194,
  "457": 1195,
  "380": 1196,
  "411": 1197,
  "rejected": 1198,
  "unknown": 1199,
  "spare": 1200,
  "parts": 1201,
  "shop": 1202,
  "committed": 1203,
  "theft": 1204,
  "worth": 1205,
  "supplementary": 1206,
  "magistrate": 1207,
  "app": 1208,
  "failed": 1209,
  "appreciate": 1210,
  "source": 1211,
  "disclosed": 1212,
  "apg": 1213,
  "prohibitory": 1214,
  "clause": 1215,
  "hardened": 1216,
  "involved": 1217,
  "many": 1218,
  "similar": 1219,
  "admitting": 1220,
  "lapses": 1221,
  "io": 1222,
  "receiving": 1223,
  "rightly": 1224,
  "position": 1225,
  "days": 1226,
  "registration": 1227,
  "received": 1228,
  "supposedly": 1229,
  "name": 1230,
  "never": 1231,
  "unless": 1232,
  "conducted": 1233,
  "mere": 1234,
  "hold": 1235,
  "nothing": 1236,
  "consideration": 1237,
  "perception": 1238,
  "expression": 1239,
  "nexus": 1240,
  "pre": 1241,
  "create": 1242,
  "involvement": 1243,
  "refers": 1244,
  "legally": 1245,
  "tenable": 1246,
  "admissible": 1247,
  "arbitrary": 1248,
  "demonstrate": 1249,
  "constituting": 1250,
  "falling": 1251,
  "limb": 1252,
  "attaining": 1253,
  "show": 1254,
  "created": 1255,
  "suspicion": 1256,
  "basic": 1257,
  "idea": 1258,
  "enable": 1259,
  "answer": 1260,
  "behind": 1261,
  "bars": 1262,
  "astuteness": 1263,
  "exception": 1264,
  "recognized": 1265,
  "pronouncements": 1266,
  "wake": 1267,
  "consequence": 1268,
  "pr": 1269,
  "abuses": 1270,
  "cancel": 1271,
  "calendar": 1272,
  "unnecessary": 1273,
  "adjournment": 1274,
  "expeditiously": 1275,
  "decide": 1276,
  "preferably": 1277,
  "khalid": 1278,
  "mansoor": 1279,
  "aqeel": 1280,
  "abbasi": 1281,
  "civil": 1282,
  "1107": 1283,
  "2015": 1284,
  "247": 1285,
  "28": 1286,
  "2014": 1287,
  "ambreen": 1288,
  "akram": 1289,
  "asad": 1290,
  "rana": 1291,
  "rashid": 1292,
  "ijaz": 1293,
  "gilani": 1294,
  "amici": 1295,
  "curiae": 1296,
  "professor": 1297,
  "khaled": 1298,
  "abou": 1299,
  "el": 1300,
  "fadl": 1301,
  "school": 1302,
  "zubair": 1303,
  "social": 1304,
  "sciences": 1305,
  "university": 1306,
  "london": 1307,
  "ms": 1308,
  "yasmin": 1309,
  "bokhari": 1310,
  "ceo": 1311,
  "barrister": 1312,
  "khadija": 1313,
  "ranjha": 1314,
  "clerk": 1315,
  "zahoor": 1316,
  "research": 1317,
  "raises": 1318,
  "foundational": 1319,
  "islamic": 1320,
  "constitutional": 1321,
  "lived": 1322,
  "realities": 1323,
  "muslim": 1324,
  "woman": 1325,
  "become": 1326,
  "marriage": 1327,
  "husband": 1328,
  "excused": 1329,
  "marital": 1330,
  "obligation": 1331,
  "wife": 1332,
  "contemporary": 1333,
  "interpretation": 1334,
  "meaning": 1335,
  "nikah": 1336,
  "relationship": 1337,
  "scope": 1338,
  "financial": 1339,
  "independence": 1340,
  "constitution": 1341,
  "republic": 1342,
  "1973": 1343,
  "promise": 1344,
  "uphold": 1345,
  "dignity": 1346,
  "privacy": 1347,
  "equality": 1348,
  "protection": 1349,
  "participation": 1350,
  "spheres": 1351,
  "giving": 1352,
  "rise": 1353,
  "solemnized": 1354,
  "contract": 1355,
  "nikahnama": 1356,
  "02": 1357,
  "2012": 1358,
  "though": 1359,
  "rukhsati": 1360,
  "scheduled": 1361,
  "february": 1362,
  "delayed": 1363,
  "year": 1364,
  "october": 1365,
  "approaching": 1366,
  "despite": 1367,
  "submitting": 1368,
  "written": 1369,
  "absent": 1370,
  "reconciliation": 1371,
  "prompting": 1372,
  "proceed": 1373,
  "ex": 1374,
  "parte": 1375,
  "awarding": 1376,
  "till": 1377,
  "subsistence": 1378,
  "meanwhile": 1379,
  "divorced": 1380,
  "partly": 1381,
  "27": 1382,
  "enhanced": 1383,
  "allowance": 1384,
  "approached": 1385,
  "consummated": 1386,
  "hence": 1387,
  "connected": 1388,
  "lawfully": 1389,
  "divorce": 1390,
  "persistent": 1391,
  "failure": 1392,
  "perform": 1393,
  "home": 1394,
  "conversely": 1395,
  "english": 1396,
  "word": 1397,
  "depart": 1398,
  "ceremony": 1399,
  "join": 1400,
  "household": 1401,
  "translated": 1402,
  "monthly": 1403,
  "arrears": 1404,
  "november": 1405,
  "tt": 1406,
  "consider": 1407,
  "pendency": 1408,
  "unable": 1409,
  "engage": 1410,
  "contracted": 1411,
  "pressure": 1412,
  "promised": 1413,
  "dissatisfied": 1414,
  "outset": 1415,
  "referring": 1416,
  "hidayah": 1417,
  "arises": 1418,
  "residence": 1419,
  "occur": 1420,
  "based": 1421,
  "submissions": 1422,
  "amicus": 1423,
  "via": 1424,
  "los": 1425,
  "angeles": 1426,
  "states": 1427,
  "addressed": 1428,
  "classical": 1429,
  "juristic": 1430,
  "foundations": 1431,
  "concept": 1432,
  "traditionally": 1433,
  "rooted": 1434,
  "ihtibas": 1435,
  "commonly": 1436,
  "understood": 1437,
  "availability": 1438,
  "outlined": 1439,
  "principal": 1440,
  "majority": 1441,
  "hanafi": 1442,
  "early": 1443,
  "holds": 1444,
  "becomes": 1445,
  "obligatory": 1446,
  "valid": 1447,
  "irrespective": 1448,
  "consummation": 1449,
  "fault": 1450,
  "contrast": 1451,
  "maliki": 1452,
  "hanbali": 1453,
  "links": 1454,
  "narrowly": 1455,
  "latter": 1456,
  "cohabitation": 1457,
  "arise": 1458,
  "endorsed": 1459,
  "firmly": 1460,
  "rejecting": 1461,
  "notion": 1462,
  "quid": 1463,
  "quo": 1464,
  "conjugal": 1465,
  "access": 1466,
  "described": 1467,
  "framing": 1468,
  "patriarchal": 1469,
  "disrespectful": 1470,
  "arguing": 1471,
  "instead": 1472,
  "due": 1473,
  "formation": 1474,
  "relies": 1475,
  "suitors": 1476,
  "acquiring": 1477,
  "legitimate": 1478,
  "absence": 1479,
  "provide": 1480,
  "stating": 1481,
  "minimum": 1482,
  "entirely": 1483,
  "consistent": 1484,
  "shari": 1485,
  "ah": 1486,
  "al": 1487,
  "marghinani": 1488,
  "guidance": 1489,
  "vol": 1490,
  "tr": 1491,
  "ahsan": 1492,
  "federal": 1493,
  "refuse": 1494,
  "contended": 1495,
  "pakistani": 1496,
  "duty": 1497,
  "immediately": 1498,
  "regardless": 1499,
  "colonial": 1500,
  "era": 1501,
  "interpretations": 1502,
  "wrongly": 1503,
  "condition": 1504,
  "physical": 1505,
  "obedience": 1506,
  "solemn": 1507,
  "transactional": 1508,
  "exchange": 1509,
  "underscored": 1510,
  "flows": 1511,
  "relying": 1512,
  "jurisprudence": 1513,
  "statutory": 1514,
  "developments": 1515,
  "laws": 1516,
  "1961": 1517,
  "mflo": 1518,
  "1964": 1519,
  "affirmed": 1520,
  "precondition": 1521,
  "unjustly": 1522,
  "articles": 1523,
  "35": 1524,
  "solemnization": 1525,
  "socio": 1526,
  "cultural": 1527,
  "practice": 1528,
  "citing": 1529,
  "contingent": 1530,
  "enables": 1531,
  "avoidance": 1532,
  "husbands": 1533,
  "imposes": 1534,
  "unfair": 1535,
  "wives": 1536,
  "move": 1537,
  "historically": 1538,
  "embedded": 1539,
  "complex": 1540,
  "submission": 1541,
  "quranic": 1542,
  "values": 1543,
  "flexible": 1544,
  "context": 1545,
  "sensitive": 1546,
  "figh": 1547,
  "transformed": 1548,
  "rigid": 1549,
  "codified": 1550,
  "system": 1551,
  "known": 1552,
  "anglo": 1553,
  "muhammadan": 1554,
  "termed": 1555,
  "personal": 1556,
  "british": 1557,
  "india": 1558,
  "see": 1559,
  "framed": 1560,
  "south": 1561,
  "asia": 1562,
  "2001": 1563,
  "modern": 1564,
  "asian": 1565,
  "studies": 1566,
  "257": 1567,
  "313": 1568,
  "raj": 1569,
  "search": 1570,
  "authenticity": 1571,
  "certainty": 1572,
  "2010": 1573,
  "69": 1574,
  "journal": 1575,
  "1142": 1576,
  "compassion": 1577,
  "subordination": 1578,
  "reward": 1579,
  "care": 1580,
  "inherent": 1581,
  "reforms": 1582,
  "countries": 1583,
  "tunisia": 1584,
  "morocco": 1585,
  "turkey": 1586,
  "longer": 1587,
  "tied": 1588,
  "affirm": 1589,
  "teachings": 1590,
  "gender": 1591,
  "wisdom": 1592,
  "carefully": 1593,
  "examined": 1594,
  "applicable": 1595,
  "address": 1596,
  "regarded": 1597,
  "ibadat": 1598,
  "transaction": 1599,
  "baillie": 1600,
  "contracts": 1601,
  "declaration": 1602,
  "acceptance": 1603,
  "sort": 1604,
  "ambiguity": 1605,
  "tanzil": 1606,
  "rahman": 1607,
  "religious": 1608,
  "man": 1609,
  "establishes": 1610,
  "progeny": 1611,
  "obligations": 1612,
  "essential": 1613,
  "requirements": 1614,
  "include": 1615,
  "offer": 1616,
  "representatives": 1617,
  "free": 1618,
  "elements": 1619,
  "amina": 1620,
  "qur": 1621,
  "sacred": 1622,
  "text": 1623,
  "perspective": 1624,
  "2nd": 1625,
  "edn": 1626,
  "oxford": 1627,
  "press": 1628,
  "1999": 1629,
  "asma": 1630,
  "barlas": 1631,
  "believing": 1632,
  "rev": 1633,
  "texas": 1634,
  "2019": 1635,
  "progressive": 1636,
  "realisation": 1637,
  "world": 1638,
  "bank": 1639,
  "https": 1640,
  "openknowledge": 1641,
  "worldbank": 1642,
  "org": 1643,
  "server": 1644,
  "api": 1645,
  "core": 1646,
  "content": 1647,
  "accessed": 1648,
  "july": 1649,
  "reform": 1650,
  "modernist": 1651,
  "status": 1652,
  "2005": 1653,
  "82": 1654,
  "mercy": 1655,
  "review": 1656,
  "algeria": 1657,
  "national": 1658,
  "key": 1659,
  "transnational": 1660,
  "factors": 1661,
  "dh": 1662,
  "gray": 1663,
  "eds": 1664,
  "change": 1665,
  "north": 1666,
  "africa": 1667,
  "counts": 1668,
  "cup": 1669,
  "308": 1670,
  "jus": 1671,
  "corpus": 1672,
  "www": 1673,
  "com": 1674,
  "neil": 1675,
  "digest": 1676,
  "smith": 1677,
  "elder": 1678,
  "1865": 1679,
  "hamdard": 1680,
  "academy": 1681,
  "1978": 1682,
  "huma": 1683,
  "saeed": 1684,
  "scmr": 1685,
  "1078": 1686,
  "mohammed": 1687,
  "salim": 1688,
  "130": 1689,
  "bano": 1690,
  "union": 1691,
  "air": 1692,
  "sc": 1693,
  "54": 1694,
  "purpose": 1695,
  "align": 1696,
  "established": 1697,
  "every": 1698,
  "serves": 1699,
  "proof": 1700,
  "indeed": 1701,
  "far": 1702,
  "arrangement": 1703,
  "foundation": 1704,
  "deeply": 1705,
  "moral": 1706,
  "responsibility": 1707,
  "describes": 1708,
  "love": 1709,
  "enjoins": 1710,
  "equitable": 1711,
  "treatment": 1712,
  "framework": 1713,
  "spiritual": 1714,
  "dimensions": 1715,
  "entering": 1716,
  "commits": 1717,
  "simply": 1718,
  "relational": 1719,
  "gives": 1720,
  "dominance": 1721,
  "reduces": 1722,
  "negates": 1723,
  "ethical": 1724,
  "recognition": 1725,
  "major": 1726,
  "schools": 1727,
  "thought": 1728,
  "recognize": 1729,
  "imperative": 1730,
  "surrenders": 1731,
  "incumbent": 1732,
  "supply": 1733,
  "food": 1734,
  "saleem": 1735,
  "government": 1736,
  "pld": 1737,
  "fsc": 1738,
  "43": 1739,
  "creating": 1740,
  "khurshid": 1741,
  "1967": 1742,
  "97": 1743,
  "sindh": 1744,
  "book": 1745,
  "judges": 1746,
  "munir": 1747,
  "sacrosanct": 1748,
  "2008": 1749,
  "surah": 1750,
  "ar": 1751,
  "rum": 1752,
  "mohammad": 1753,
  "kamali": 1754,
  "3rd": 1755,
  "publishers": 1756,
  "2003": 1757,
  "clothing": 1758,
  "lodging": 1759,
  "surrender": 1760,
  "lies": 1761,
  "heart": 1762,
  "jurists": 1763,
  "conditional": 1764,
  "often": 1765,
  "defined": 1766,
  "relations": 1767,
  "doctrine": 1768,
  "seclusion": 1769,
  "retention": 1770,
  "formulation": 1771,
  "incompatible": 1772,
  "anic": 1773,
  "vision": 1774,
  "covenant": 1775,
  "especially": 1776,
  "shaped": 1777,
  "maqasid": 1778,
  "objectives": 1779,
  "compels": 1780,
  "broader": 1781,
  "ghazali": 1782,
  "outlines": 1783,
  "protect": 1784,
  "essentials": 1785,
  "religion": 1786,
  "intellect": 1787,
  "scholars": 1788,
  "ibn": 1789,
  "ashur": 1790,
  "jasser": 1791,
  "auda": 1792,
  "applying": 1793,
  "institution": 1794,
  "premised": 1795,
  "companionship": 1796,
  "aims": 1797,
  "entails": 1798,
  "control": 1799,
  "sided": 1800,
  "authority": 1801,
  "prominent": 1802,
  "criticized": 1803,
  "thorough": 1804,
  "sources": 1805,
  "treating": 1806,
  "sexual": 1807,
  "enjoyment": 1808,
  "violates": 1809,
  "challenged": 1810,
  "legacy": 1811,
  "invoked": 1812,
  "sheikh": 1813,
  "abi": 1814,
  "hidaya": 1815,
  "commentary": 1816,
  "hamilton": 1817,
  "darul": 1818,
  "241": 1819,
  "abii": 1820,
  "hamid": 1821,
  "min": 1822,
  "im": 1823,
  "dar": 1824,
  "kutub": 1825,
  "1993": 1826,
  "beirut": 1827,
  "sid": 1828,
  "philosophy": 1829,
  "systems": 1830,
  "approach": 1831,
  "international": 1832,
  "institute": 1833,
  "ishaq": 1834,
  "shatibi": 1835,
  "fi": 1836,
  "kazmi": 1837,
  "parvaiz": 1838,
  "aj": 1839,
  "k": 1840,
  "reinforce": 1841,
  "male": 1842,
  "guise": 1843,
  "jurisdictions": 1844,
  "away": 1845,
  "traditional": 1846,
  "notions": 1847,
  "wilayah": 1848,
  "female": 1849,
  "accordingly": 1850,
  "autonomy": 1851,
  "security": 1852,
  "coercive": 1853,
  "guided": 1854,
  "reasoning": 1855,
  "favor": 1856,
  "frameworks": 1857,
  "center": 1858,
  "absolute": 1859,
  "enforceable": 1860,
  "discretionary": 1861,
  "empowers": 1862,
  "initiate": 1863,
  "neglect": 1864,
  "requiring": 1865,
  "provision": 1866,
  "orientation": 1867,
  "enabling": 1868,
  "assert": 1869,
  "customs": 1870,
  "governing": 1871,
  "cambridge": 1872,
  "99": 1873,
  "74": 1874,
  "87": 1875,
  "93": 1876,
  "adequately": 1877,
  "remedy": 1878,
  "chairman": 1879,
  "constitute": 1880,
  "arbitration": 1881,
  "council": 1882,
  "determine": 1883,
  "issue": 1884,
  "certificate": 1885,
  "specifying": 1886,
  "paid": 1887,
  "prescribed": 1888,
  "fee": 1889,
  "prefer": 1890,
  "collector": 1891,
  "concerned": 1892,
  "final": 1893,
  "payable": 1894,
  "sub": 1895,
  "recoverable": 1896,
  "land": 1897,
  "revenue": 1898,
  "29": 1899,
  "suit": 1900,
  "appearance": 1901,
  "defendant": 1902,
  "fix": 1903,
  "interim": 1904,
  "fourteen": 1905,
  "struck": 1906,
  "averments": 1907,
  "plaint": 1908,
  "supporting": 1909,
  "documents": 1910,
  "higher": 1911,
  "prayed": 1912,
  "relevant": 1913,
  "prescribe": 1914,
  "annual": 1915,
  "increase": 1916,
  "introducing": 1917,
  "expeditious": 1918,
  "summary": 1919,
  "introduction": 1920,
  "legislature": 1921,
  "structural": 1922,
  "barriers": 1923,
  "faced": 1924,
  "attempt": 1925,
  "accessible": 1926,
  "remedial": 1927,
  "together": 1928,
  "statutes": 1929,
  "beneficial": 1930,
  "affirms": 1931,
  "existence": 1932,
  "performance": 1933,
  "interpreted": 1934,
  "line": 1935,
  "guarantees": 1936,
  "consequences": 1937,
  "practices": 1938,
  "customary": 1939,
  "marking": 1940,
  "literally": 1941,
  "means": 1942,
  "culturally": 1943,
  "significant": 1944,
  "marks": 1945,
  "formal": 1946,
  "commencement": 1947,
  "carries": 1948,
  "immediate": 1949,
  "point": 1950,
  "spouses": 1951,
  "assume": 1952,
  "corresponding": 1953,
  "ultimate": 1954,
  "willingness": 1955,
  "enter": 1956,
  "discharge": 1957,
  "matrimonial": 1958,
  "effected": 1959,
  "fixed": 1960,
  "automatically": 1961,
  "increased": 1962,
  "rate": 1963,
  "percent": 1964,
  "purposes": 1965,
  "fixing": 1966,
  "summon": 1967,
  "organization": 1968,
  "body": 1969,
  "estate": 1970,
  "resources": 1971,
  "yasmeen": 1972,
  "2016": 1973,
  "saif": 1974,
  "adj": 1975,
  "tek": 1976,
  "singh": 1977,
  "zeeshan": 1978,
  "iftikhar": 1979,
  "clc": 1980,
  "777": 1981,
  "nawaz": 1982,
  "begum": 1983,
  "1972": 1984,
  "nasim": 1985,
  "ara": 1986,
  "1968": 1987,
  "sardar": 1988,
  "1966": 1989,
  "33": 1990,
  "dictionary": 1991,
  "najam": 1992,
  "masooma": 1993,
  "991": 1994,
  "sharif": 1995,
  "2007": 1996,
  "49": 1997,
  "shamim": 1998,
  "akhtar": 1999,
  "sialkot": 2000,
  "1991": 2001,
  "analytical": 2002,
  "study": 2003,
  "37": 2004,
  "haseen": 2005,
  "naheed": 2006,
  "686": 2007,
  "responsibilities": 2008,
  "invoking": 2009,
  "unconstitutional": 2010,
  "reinforces": 2011,
  "holistic": 2012,
  "reading": 2013,
  "aforesaid": 2014,
  "protections": 2015,
  "precedents": 2016,
  "constitutes": 2017,
  "binding": 2018,
  "exceptions": 2019,
  "affect": 2020,
  "returns": 2021,
  "breach": 2022,
  "restraint": 2023,
  "amounts": 2024,
  "nushuz": 2025,
  "justified": 2026,
  "tanzilur": 2027,
  "identifies": 2028,
  "precedent": 2029,
  "acknowledges": 2030,
  "cohabit": 2031,
  "keep": 2032,
  "remains": 2033,
  "calls": 2034,
  "placing": 2035,
  "ownership": 2036,
  "lens": 2037,
  "reduced": 2038,
  "38": 2039,
  "242": 2040,
  "40": 2041,
  "259": 2042,
  "human": 2043,
  "urge": 2044,
  "living": 2045,
  "fundamental": 2046,
  "evolving": 2047,
  "42": 2048,
  "paying": 2049,
  "clear": 2050,
  "cogent": 2051,
  "wholly": 2052,
  "repudiated": 2053,
  "residential": 2054,
  "aspects": 2055,
  "abuse": 2056,
  "behaviour": 2057,
  "appropriate": 2058,
  "repudiation": 2059,
  "effect": 2060,
  "dower": 2061,
  "non": 2062,
  "construed": 2063,
  "voluntary": 2064,
  "withdrawal": 2065,
  "intact": 2066,
  "untenable": 2067,
  "constitutionally": 2068,
  "suspect": 2069,
  "standard": 2070,
  "forces": 2071,
  "private": 2072,
  "disprove": 2073,
  "impossible": 2074,
  "risks": 2075,
  "interpret": 2076,
  "flawed": 2077,
  "facilitates": 2078,
  "economic": 2079,
  "denying": 2080,
  "texts": 2081,
  "society": 2082,
  "magasid": 2083,
  "new": 2084,
  "methodology": 2085,
  "ethics": 2086,
  "disagreement": 2087,
  "2004": 2088,
  "shaheen": 2089,
  "ylr": 2090,
  "349": 2091,
  "vy": 2092,
  "fahim": 2093,
  "shahnaz": 2094,
  "provides": 2095,
  "unjustified": 2096,
  "denial": 2097,
  "proves": 2098,
  "compelling": 2099,
  "withdrawn": 2100,
  "demand": 2101,
  "cautious": 2102,
  "interpreting": 2103,
  "ensuring": 2104,
  "shield": 2105,
  "tool": 2106,
  "coercion": 2107,
  "enactments": 2108,
  "discretion": 2109,
  "essence": 2110,
  "justification": 2111,
  "encompassing": 2112,
  "full": 2113,
  "spectrum": 2114,
  "spirit": 2115,
  "unit": 2116,
  "systemic": 2117,
  "injustice": 2118,
  "curtail": 2119,
  "subjected": 2120,
  "jurisprudential": 2121,
  "much": 2122,
  "less": 2123,
  "cause": 2124,
  "abode": 2125,
  "steps": 2126,
  "fulfill": 2127,
  "factual": 2128,
  "invoke": 2129,
  "narrow": 2130,
  "credible": 2131,
  "led": 2132,
  "willfully": 2133,
  "withdrew": 2134,
  "inability": 2135,
  "defeat": 2136,
  "penalized": 2137,
  "allow": 2138,
  "men": 2139,
  "caused": 2140,
  "mean": 2141,
  "escape": 2142,
  "marriages": 2143,
  "devoid": 2144,
  "accrued": 2145,
  "throughout": 2146,
  "continue": 2147,
  "iddat": 2148,
  "part": 2149,
  "foregoing": 2150,
  "5000": 2151,
  "adjudicated": 2152,
  "accepted": 2153,
  "deems": 2154,
  "important": 2155,
  "acknowledge": 2156,
  "valuable": 2157,
  "records": 2158,
  "invaluable": 2159,
  "assistance": 2160,
  "44": 2161,
  "aided": 2162,
  "deliberations": 2163,
  "comparative": 2164,
  "depth": 2165,
  "clarity": 2166,
  "helped": 2167,
  "global": 2168,
  "adjudication": 2169,
  "inclusive": 2170,
  "relevance": 2171,
  "serve": 2172,
  "vital": 2173,
  "bridge": 2174,
  "embracing": 2175,
  "deliberation": 2176,
  "legitimacy": 2177,
  "quality": 2178,
  "judiciary": 2179,
  "dialogue": 2180,
  "find": 2181,
  "aspect": 2182,
  "language": 2183,
  "impact": 2184,
  "words": 2185,
  "extends": 2186,
  "note": 2187,
  "crossing": 2188,
  "45": 2189,
  "employed": 2190,
  "actively": 2191,
  "structure": 2192,
  "force": 2193,
  "practiced": 2194,
  "expressions": 2195,
  "recipients": 2196,
  "partners": 2197,
  "paragraph": 2198,
  "discrimination": 2199,
  "reflecting": 2200,
  "litigants": 2201,
  "prevailing": 2202,
  "capable": 2203,
  "toward": 2204,
  "thinking": 2205,
  "bear": 2206,
  "adopt": 2207,
  "autonomous": 2208,
  "decisions": 2209,
  "avoid": 2210,
  "promote": 2211,
  "46": 2212,
  "fulfilling": 2213,
  "societal": 2214,
  "advances": 2215,
  "neutral": 2216,
  "announced": 2217,
  "september": 2218,
  "zahida": 2219,
  "parveen": 2220,
  "scp": 2221,
  "107": 2222,
  "abbottabad": 2223,
  "cri": 2224,
  "193": 2225,
  "ameen": 2226,
  "talpur": 2227,
  "arshad": 2228,
  "sr": 2229,
  "ons": 2230,
  "khanpur": 2231,
  "haripur": 2232,
  "arif": 2233,
  "ood": 2234,
  "19th": 2235,
  "ith": 2236,
  "pistol": 2237,
  "expert": 2238,
  "availed": 2239,
  "sheraz": 2240,
  "15th": 2241,
  "ies": 2242,
  "confirms": 2243,
  "witness": 2244,
  "shal": 2245,
  "influence": 2246,
  "athar": 2247,
  "minallah": 2248,
  "351": 2249,
  "352": 2250,
  "karachi": 2251,
  "276": 2252,
  "288": 2253,
  "289": 2254,
  "saddam": 2255,
  "appellants": 2256,
  "video": 2257,
  "link": 2258,
  "latif": 2259,
  "khosa": 2260,
  "rahat": 2261,
  "317": 2262,
  "144": 2263,
  "ata": 2264,
  "saddar": 2265,
  "318": 2266,
  "seventeen": 2267,
  "live": 2268,
  "bullets": 2269,
  "viii": 2270,
  "u": 2271,
  "suffer": 2272,
  "seven": 2273,
  "punishable": 2274,
  "properties": 2275,
  "ordered": 2276,
  "382": 2277,
  "run": 2278,
  "consecutively": 2279,
  "maintained": 2280,
  "contents": 2281,
  "yasin": 2282,
  "emergency": 2283,
  "ward": 2284,
  "jinnah": 2285,
  "medical": 2286,
  "sustaining": 2287,
  "abovementioned": 2288,
  "officials": 2289,
  "apprehended": 2290,
  "managed": 2291,
  "flee": 2292,
  "participated": 2293,
  "cctv": 2294,
  "camera": 2295,
  "showed": 2296,
  "inflicted": 2297,
  "rod": 2298,
  "blow": 2299,
  "postmortem": 2300,
  "photographs": 2301,
  "help": 2302,
  "exhibited": 2303,
  "page": 2304,
  "275": 2305,
  "277": 2306,
  "279": 2307,
  "281": 2308,
  "283": 2309,
  "paper": 2310,
  "perusal": 2311,
  "shows": 2312,
  "could": 2313,
  "seen": 2314,
  "carrying": 2315,
  "iron": 2316,
  "box": 2317,
  "declared": 2318,
  "hostile": 2319,
  "true": 2320,
  "gohar": 2321,
  "niaz": 2322,
  "although": 2323,
  "apart": 2324,
  "identification": 2325,
  "parade": 2326,
  "whatsoever": 2327,
  "keeping": 2328,
  "aforementioned": 2329,
  "irresistible": 2330,
  "shadow": 2331,
  "charges": 2332,
  "released": 2333,
  "detained": 2334,
  "coming": 2335,
  "eye": 2336,
  "posted": 2337,
  "performing": 2338,
  "patrol": 2339,
  "attacked": 2340,
  "culprits": 2341,
  "pws": 2342,
  "chased": 2343,
  "magazine": 2344,
  "length": 2345,
  "shaken": 2346,
  "trustworthy": 2347,
  "corroborated": 2348,
  "positive": 2349,
  "examiner": 2350,
  "produce": 2351,
  "licence": 2352,
  "justify": 2353,
  "insofar": 2354,
  "vendetta": 2355,
  "bari": 2356,
  "ramzan": 2357,
  "murdered": 2358,
  "grudge": 2359,
  "evident": 2360,
  "antiterrorism": 2361,
  "attracted": 2362,
  "bring": 2363,
  "ingredients": 2364,
  "observed": 2365,
  "reported": 2366,
  "abrar": 2367,
  "faroog": 2368,
  "78": 2369,
  "held": 2370,
  "premises": 2371,
  "attract": 2372,
  "convictions": 2373,
  "setaside": 2374,
  "upheld": 2375,
  "treated": 2376,
  "resultantly": 2377,
  "mentioning": 2378,
  "offshoot": 2379,
  "397": 2380,
  "concurrently": 2381,
  "decided": 2382,
  "585": 2383,
  "irshad": 2384,
  "shakeel": 2385,
  "sajjad": 2386,
  "hayat": 2387,
  "prayer": 2388,
  "160": 2389,
  "337a": 2390,
  "narowal": 2391,
  "partially": 2392,
  "sajid": 2393,
  "assigned": 2394,
  "inflicting": 2395,
  "wooden": 2396,
  "bala": 2397,
  "younas": 2398,
  "hatchet": 2399,
  "head": 2400,
  "sufiyan": 2401,
  "member": 2402,
  "relief": 2403,
  "ehsan": 2404,
  "70": 2405,
  "medico": 2406,
  "skin": 2407,
  "deep": 2408,
  "bone": 2409,
  "exposed": 2410,
  "finding": 2411,
  "exposing": 2412,
  "categorically": 2413,
  "bailable": 2414,
  "reference": 2415,
  "555": 2416,
  "sixteen": 2417,
  "total": 2418,
  "possibility": 2419,
  "malafide": 2420,
  "using": 2421,
  "wider": 2422,
  "net": 2423,
  "ruled": 2424,
  "ad": 2425,
  "fresh": 2426,
  "rupees": 2427,
  "fifty": 2428,
  "thousand": 2429,
  "yy": 2430,
  "zia": 2431,
  "pg": 2432,
  "mahnoor": 2433,
  "omer": 2434,
  "185": 2435,
  "cns": 2436,
  "concisely": 2437,
  "naeem": 2438,
  "chowk": 2439,
  "seized": 2440,
  "black": 2441,
  "polythene": 2442,
  "bag": 2443,
  "hand": 2444,
  "charas": 2445,
  "1280": 2446,
  "grams": 2447,
  "contraband": 2448,
  "discovered": 2449,
  "weighing": 2450,
  "sample": 2451,
  "bulk": 2452,
  "sealed": 2453,
  "64": 2454,
  "gram": 2455,
  "separated": 2456,
  "chemical": 2457,
  "500": 2458,
  "promptly": 2459,
  "433": 2460,
  "numerous": 2461,
  "deficiencies": 2462,
  "populated": 2463,
  "entire": 2464,
  "associate": 2465,
  "impartiality": 2466,
  "served": 2467,
  "unexplained": 2468,
  "delay": 2469,
  "transporting": 2470,
  "casts": 2471,
  "chain": 2472,
  "unreliable": 2473,
  "quantity": 2474,
  "deposited": 2475,
  "malkhana": 2476,
  "concerns": 2477,
  "safe": 2478,
  "conclusions": 2479,
  "contending": 2480,
  "effectively": 2481,
  "vitiated": 2482,
  "sheer": 2483,
  "sending": 2484,
  "tampering": 2485,
  "competent": 2486,
  "intent": 2487,
  "animosity": 2488,
  "december": 2489,
  "containing": 2490,
  "retrieved": 2491,
  "tested": 2492,
  "pfsa": 2493,
  "transmitted": 2494,
  "indicates": 2495,
  "substance": 2496,
  "transmission": 2497,
  "samples": 2498,
  "regard": 2499,
  "ikramullah": 2500,
  "1002": 2501,
  "given": 2502,
  "careful": 2503,
  "importance": 2504,
  "fair": 2505,
  "guaranteed": 2506,
  "necessitates": 2507,
  "stringent": 2508,
  "punishments": 2509,
  "appearing": 2510,
  "necessary": 2511,
  "eliminate": 2512,
  "potential": 2513,
  "bias": 2514,
  "predetermined": 2515,
  "requirement": 2516,
  "critical": 2517,
  "impose": 2518,
  "severe": 2519,
  "reverse": 2520,
  "prohibited": 2521,
  "conducting": 2522,
  "cnsa": 2523,
  "nevertheless": 2524,
  "genuine": 2525,
  "likelihood": 2526,
  "follows": 2527,
  "portray": 2528,
  "biased": 2529,
  "false": 2530,
  "hotel": 2531,
  "credit": 2532,
  "delivery": 2533,
  "borrow": 2534,
  "facility": 2535,
  "huge": 2536,
  "money": 2537,
  "outstanding": 2538,
  "bill": 2539,
  "became": 2540,
  "planted": 2541,
  "officers": 2542,
  "strengthen": 2543,
  "innocent": 2544,
  "deserves": 2545,
  "transferred": 2546,
  "ef": 2547,
  "included": 2548,
  "drafting": 2549,
  "complaint": 2550,
  "pb": 2551,
  "preparation": 2552,
  "creation": 2553,
  "pc": 2554,
  "161": 2555,
  "deposit": 2556,
  "subsequent": 2557,
  "miscarriage": 2558,
  "offense": 2559,
  "objectionable": 2560,
  "features": 2561,
  "infirmities": 2562,
  "legitimately": 2563,
  "grievance": 2564,
  "carried": 2565,
  "ulterior": 2566,
  "chapter": 2567,
  "rules": 2568,
  "1934": 2569,
  "truth": 2570,
  "object": 2571,
  "real": 2572,
  "offender": 2573,
  "offenders": 2574,
  "rajput": 2575,
  "510": 2576,
  "plays": 2577,
  "crucial": 2578,
  "administration": 2579,
  "constituent": 2580,
  "keeps": 2581,
  "adjudicating": 2582,
  "award": 2583,
  "foremost": 2584,
  "objective": 2585,
  "whether": 2586,
  "attached": 2587,
  "manipulation": 2588,
  "exceeding": 2589,
  "bounds": 2590,
  "defective": 2591,
  "gradually": 2592,
  "poses": 2593,
  "hazard": 2594,
  "superior": 2595,
  "ensure": 2596,
  "honest": 2597,
  "aim": 2598,
  "bringing": 2599,
  "likewise": 2600,
  "natural": 2601,
  "frequently": 2602,
  "deprived": 2603,
  "safeguard": 2604,
  "raiding": 2605,
  "primary": 2606,
  "defense": 2607,
  "ashiq": 2608,
  "alias": 2609,
  "1989": 2610,
  "lj": 2611,
  "601": 2612,
  "shariat": 2613,
  "investigations": 2614,
  "prejudiced": 2615,
  "risk": 2616,
  "implication": 2617,
  "marginal": 2618,
  "members": 2619,
  "accountable": 2620,
  "corroboration": 2621,
  "acting": 2622,
  "practical": 2623,
  "acted": 2624,
  "farrukh": 2625,
  "385": 2626,
  "province": 2627,
  "bhakkar": 2628,
  "uz": 2629,
  "zaman": 2630,
  "bees": 2631,
  "tehsildar": 2632,
  "akbar": 2633,
  "nusrat": 2634,
  "phrase": 2635,
  "technicality": 2636,
  "aptly": 2637,
  "situation": 2638,
  "underscores": 2639,
  "implications": 2640,
  "believe": 2641,
  "ought": 2642,
  "revised": 2643,
  "practitioners": 2644,
  "sometimes": 2645,
  "mistakes": 2646,
  "pleadings": 2647,
  "filing": 2648,
  "errors": 2649,
  "recognise": 2650,
  "warrant": 2651,
  "strict": 2652,
  "measures": 2653,
  "wrong": 2654,
  "degree": 2655,
  "leniency": 2656,
  "accorded": 2657,
  "stem": 2658,
  "misconduct": 2659,
  "adopting": 2660,
  "forgiving": 2661,
  "prevent": 2662,
  "mission": 2663,
  "respected": 2664,
  "technical": 2665,
  "ability": 2666,
  "rectifying": 2667,
  "expectation": 2668,
  "trust": 2669,
  "substantial": 2670,
  "compliance": 2671,
  "integrity": 2672,
  "efficacy": 2673,
  "processes": 2674,
  "compelled": 2675,
  "prefatory": 2676,
  "require": 2677,
  "elaborate": 2678,
  "underlying": 2679,
  "allotted": 2680,
  "kanals": 2681,
  "abdullah": 2682,
  "predecessor": 2683,
  "scheme": 2684,
  "pursuant": 2685,
  "lands": 2686,
  "connection": 2687,
  "executed": 2688,
  "power": 2689,
  "attorney": 2690,
  "sell": 2691,
  "fulfil": 2692,
  "resorted": 2693,
  "action": 2694,
  "initiating": 2695,
  "sale": 2696,
  "multiple": 2697,
  "presented": 2698,
  "thoroughly": 2699,
  "evaluated": 2700,
  "requested": 2701,
  "endeavour": 2702,
  "mistake": 2703,
  "memorandum": 2704,
  "inadequately": 2705,
  "stamped": 2706,
  "lacked": 2707,
  "fees": 2708,
  "repeatedly": 2709,
  "adjournments": 2710,
  "rectify": 2711,
  "deficiency": 2712,
  "rejection": 2713,
  "standards": 2714,
  "moot": 2715,
  "looking": 2716,
  "collection": 2717,
  "operates": 2718,
  "agent": 2719,
  "fiscal": 2720,
  "legislation": 2721,
  "1870": 2722,
  "strictly": 2723,
  "steady": 2724,
  "benefits": 2725,
  "empower": 2726,
  "adversaries": 2727,
